/**
 * Created by chenxingyu on 2017/1/19.
 */
const dateInfo = {
    // 农历1900-2100的润大小信息表
    lunarInfo: [
        0x4bd8, 0x4ae0, 0xa570, 0x54d5, 0xd260, 0xd950, 0x5554, 0x56af, 0x9ad0, 0x55d2,
        0x4ae0, 0xa5b6, 0xa4d0, 0xd250, 0xd255, 0xb54f, 0xd6a0, 0xada2, 0x95b0, 0x4977,
        0x497f, 0xa4b0, 0xb4b5, 0x6a50, 0x6d40, 0xab54, 0x2b6f, 0x9570, 0x52f2, 0x4970,
        0x6566, 0xd4a0, 0xea50, 0x6a95, 0x5adf, 0x2b60, 0x86e3, 0x92ef, 0xc8d7, 0xc95f,
        0xd4a0, 0xd8a6, 0xb55f, 0x56a0, 0xa5b4, 0x25df, 0x92d0, 0xd2b2, 0xa950, 0xb557,
        0x6ca0, 0xb550, 0x5355, 0x4daf, 0xa5b0, 0x4573, 0x52bf, 0xa9a8, 0xe950, 0x6aa0,
        0xaea6, 0xab50, 0x4b60, 0xaae4, 0xa570, 0x5260, 0xf263, 0xd950, 0x5b57, 0x56a0,
        0x96d0, 0x4dd5, 0x4ad0, 0xa4d0, 0xd4d4, 0xd250, 0xd558, 0xb540, 0xb6a0, 0x95a6,
        0x95bf, 0x49b0, 0xa974, 0xa4b0, 0xb27a, 0x6a50, 0x6d40, 0xaf46, 0xab60, 0x9570,
        0x4af5, 0x4970, 0x64b0, 0x74a3, 0xea50, 0x6b58, 0x5ac0, 0xab60, 0x96d5, 0x92e0,
        0xc960, 0xd954, 0xd4a0, 0xda50, 0x7552, 0x56a0, 0xabb7, 0x25d0, 0x92d0, 0xcab5,
        0xa950, 0xb4a0, 0xbaa4, 0xad50, 0x55d9, 0x4ba0, 0xa5b0, 0x5176, 0x52bf, 0xa930,
        0x7954, 0x6aa0, 0xad50, 0x5b52, 0x4b60, 0xa6e6, 0xa4e0, 0xd260, 0xea65, 0xd530,
        0x5aa0, 0x76a3, 0x96d0, 0x4afb, 0x4ad0, 0xa4d0, 0xd0b6, 0xd25f, 0xd520, 0xdd45,
        0xb5a0, 0x56d0, 0x55b2, 0x49b0, 0xa577, 0xa4b0, 0xaa50, 0xb255, 0x6d2f, 0xada0,
        0x4b63, 0x937f, 0x49f8, 0x4970, 0x64b0, 0x68a6, 0xea5f, 0x6b20, 0xa6c4, 0xaaef,
        0x92e0, 0xd2e3, 0xc960, 0xd557, 0xd4a0, 0xda50, 0x5d55, 0x56a0, 0xa6d0, 0x55d4,
        0x52d0, 0xa9b8, 0xa950, 0xb4a0, 0xb6a6, 0xad50, 0x55a0, 0xaba4, 0xa5b0, 0x52b0,
        0xb273, 0x6930, 0x7337, 0x6aa0, 0xad50, 0x4b55, 0x4b6f, 0xa570, 0x54e4, 0xd260,
        0xe968, 0xd520, 0xdaa0, 0x6aa6, 0x56df, 0x4ae0, 0xa9d4, 0xa4d0, 0xd150, 0xf252,
        0xd520],

    // 公历每个月份的天数普通表
    solarMonth: [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31],
    //中文月份
    chineseMonth : ['' , '一', '二' , '三' , '四', '五', '六', '七', '八', '九', '十' ,'十一' , '十二'],
    // 天干
    gan: ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"],
    // 地支
    zhi: ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"],
    // 生肖
    animals: ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"],
    // 二十四节气
    solarTerm: ["小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏",
        "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分",
        "寒露", "霜降", "立冬", "小雪", "大雪", "冬至"],
    sTermInfo: [0, 21208, 42467, 63836, 85337, 107014, 128867, 150921, 173149, 195551,
        218072, 240693, 263343, 285989, 308563, 331033, 353350, 375494, 397447,
        419210, 440795, 462224, 483532, 504758],
    nStr1: ['日', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十'],
    nStr2: ['初', '十', '廿', '卅', ' '],

    jcName0: ['建', '除', '满', '平', '定', '执', '破', '危', '成', '收', '开', '闭'],
    jcName1: ['闭', '建', '除', '满', '平', '定', '执', '破', '危', '成', '收', '开'],
    jcName2: ['开', '闭', '建', '除', '满', '平', '定', '执', '破', '危', '成', '收'],
    jcName3: ['收', '开', '闭', '建', '除', '满', '平', '定', '执', '破', '危', '成'],
    jcName4: ['成', '收', '开', '闭', '建', '除', '满', '平', '定', '执', '破', '危'],
    jcName5: ['危', '成', '收', '开', '闭', '建', '除', '满', '平', '定', '执', '破'],
    jcName6: ['破', '危', '成', '收', '开', '闭', '建', '除', '满', '平', '定', '执'],
    jcName7: ['执', '破', '危', '成', '收', '开', '闭', '建', '除', '满', '平', '定'],
    jcName8: ['定', '执', '破', '危', '成', '收', '开', '闭', '建', '除', '满', '平'],
    jcName9: ['平', '定', '执', '破', '危', '成', '收', '开', '闭', '建', '除', '满'],
    jcName10: ['满', '平', '定', '执', '破', '危', '成', '收', '开', '闭', '建', '除'],
    jcName11: ['除', '满', '平', '定', '执', '破', '危', '成', '收', '开', '闭', '建'],

    jcr: function (d) {
        var jcrjx;
        if (d == '建') jcrjx = {'suited': ['出行', '上任', '会友', '上书', '见工'], 'tapu': ['动土', '开仓', '嫁娶', '纳采']};
        if (d == '除') jcrjx = {'suited': ['除服', '疗病', '出行', '拆卸', '入宅'], 'tapu': ['求官', '上任', '开张', '搬家', '探病']};
        if (d == '满') jcrjx = {'suited': ['祈福', '祭祀', '结亲', '开市', '交易'], 'tapu': ['服药', '求医', '栽种', '动土', '迁移']};
        if (d == '平') jcrjx = {'suited': ['祭祀', '修填', '涂泥', '余事勿取'], 'tapu': ['移徙', '入宅', '嫁娶', '开市', '安葬']};
        if (d == '定') jcrjx = {'suited': ['易', '立券', '会友', '签约', '纳畜'], 'tapu': ['种植', '置业', '卖田', '掘井', '造船']};
        if (d == '执') jcrjx = {'suited': ['祈福', '祭祀', '求子', '结婚', '立约'], 'tapu': ['开市', '交易', '搬家', '远行']};
        if (d == '破') jcrjx = {'suited': ['求医', '赴考', '祭祀', '余事勿取'], 'tapu': ['动土', '出行', '移徙', '开市', '修造']};
        if (d == '危') jcrjx = {'suited': ['经营', '交易', '求官', '纳畜', '动土'], 'tapu': ['登高', '行船', '安床', '入宅', '博彩']};
        if (d == '成') jcrjx = {'suited': ['祈福', '入学', '开市', '求医', '成服'], 'tapu': ['词讼', '安门', '移徙']};
        if (d == '收') jcrjx = {'suited': ['祭祀', '求财', '签约', '嫁娶', '订盟'], 'tapu': ['开市', '安床', '安葬', '入宅', '破土']};
        if (d == '开') jcrjx = {'suited': ['疗病', '结婚', '交易', '入仓', '求职'], 'tapu': ['安葬', '动土', '针灸']};
        if (d == '闭') jcrjx = {'suited': ['祭祀', '交易', '收财', '安葬'], 'tapu': ['宴会', '安床', '出行', '嫁娶', '移徙']};
        return jcrjx;
    },

    //国历节日  *表示放假日
    sFtv: [
        "0101  元旦",

        "0214  情人节",

        "0308  妇女节",
        "0312  植树节 ",

        "0401  愚人节",

        "0501  劳动节",
        "0504  青年节",

        "0601  儿童节",

        "0701  香港回归",

        "0801  八一建军节",

        "0910  教师节",
        "0918  九·一八",

        "1001  国庆节",
        "1031  万圣节",

        "1220  澳门回归",
        "1224  平安夜",
        "1225  圣诞节"
    ],
    //农历节日  *表示放假日
    lFtv: [
        "0101*春节",
        "0102*年初二",
        "0103*年初三",
        "0115  元宵节",
        "0202  龙抬头",
        "0505*端午节",
        "0707  七夕",
        "0815*中秋节",
        "0909  重阳节",
        "1208  腊八节",
        "1223  小年",
        "0100*除夕"
    ],
    //某月的第几个星期几; 5,6,7,8 表示到数第 1,2,3,4 个星期几
    wFtv: [
        "0520  母亲节",
        "0630  父亲节",
        "1144  感恩节"
    ],
    yFtv : [

    ]
};

module.exports = dateInfo;